PROPOSAL

In [41]:
library(tidyverse)
library(repr)
library(tidymodels)
options(repr.matrix.max.rows = 8)
library(readxl)

set.seed(16)

# Preliminary Exploratory Data Analysis
The data that we downloaded from the website was already in tidy format because each row represented an observation, each column is a single variable, and each value is a single cell. We removed all the 'NA' from the table. We decided to make the data set smaller by combining the kidhome and teenhome columns into a Childhome column. We also combined the amount spent on all the different categories of food into a single Total_Spent column. Lastly, we used the year_birth to find the customer's age. We decided to change the date from type character to an actual date using the as.Date() function. We also changed response to a factor instead of a double.

In [29]:
data <- read_csv("superstore_data.csv")
store_data <- data |>
    na.omit() |>
    mutate(Childhome = Kidhome + Teenhome) |>
    select(-Kidhome, -Teenhome) |>
    mutate(Age = 2022 - Year_Birth) |>
    select(-Year_Birth) |>
    mutate(Total_Spent = MntWines + MntFruits + MntMeatProducts + MntFishProducts + MntSweetProducts) |>
    select(-MntWines, -MntFruits, -MntMeatProducts, -MntFishProducts, -MntSweetProducts) |>
    mutate(Dt_Customer = as.Date(Dt_Customer, "%m/%d/%Y")) |>
    mutate(Response = as.factor(Response))
store_data

Rows: 2240 Columns: 22
── Column specification ────────────────────────────────────────────────────────
Delimiter: ","
chr  (3): Education, Marital_Status, Dt_Customer
dbl (19): Id, Year_Birth, Income, Kidhome, Teenhome, Recency, MntWines, MntF...

ℹ Use `spec()` to retrieve the full column specification for this data.
ℹ Specify the column types or set `show_col_types = FALSE` to quiet this message.

     Id    Education  Marital_Status Income Dt_Customer Recency MntGoldProds
1     1826 Graduation Divorced       84835  2014-06-16  0       218
2        1 Graduation Single         57091  2014-06-15  0        37
3    10476 Graduation Married        67267  2014-05-13  0        30
⋮    ⋮     ⋮          ⋮              ⋮      ⋮           ⋮       ⋮
2214   22  Graduation Divorced       46310  2012-03-12  99       14
2215  528  Graduation Married        65819  2012-11-29  99       63
2216 4070  PhD        Married        94871  2012-01-09  99      144
     NumDealsPurchases NumWebPurchases NumCatalogPurchases NumStorePurchases
1    1                 4               4                   6
2    1                 7               3                   7
3    1                 3               2                   5
⋮    ⋮                 ⋮               ⋮                   ⋮
2214 2                 6               1                    5
2215 1                 5               4                   10
2216 1                 8               5                    4
     NumWebVisitsMonth Response Complain Childhome Age Total_Spent
1    1                 1        0        0         52  972
2    5                 1        0        0         61  540
3    2                 0        0        1         64  221
⋮    ⋮                 ⋮        ⋮        ⋮         ⋮   ⋮
2214 8                 0        0        1         46   295
2215 3                 0        0        0         44  1320
2216 7                 1        0        2         53   934

We then split our data in 75% training and 25% testing data (although we don't use testing data for now). We see that we have 22 variables, but we will not use all of them. Instead, we will focus on the customer's age, income, total amount spent, and children.

After the split, we see that there are 1661 observations in the training set and 555 observations in the testing set. We summarized the four numerical variables below.

In [44]:
store_data_split <- initial_split(store_data, prop = 0.75, strata = Response)
store_data_train <- training(store_data_split) |>
    select(Marital_Status, Age, Income, Total_Spent, Childhome, Response)
store_data_test <- testing(store_data_split) |>
    select(Marital_Status, Age, Income, Total_Spent, Childhome, Response)
store_data_train

glimpse(store_data_train)
glimpse(store_data_test)

count_summary <- store_data_train |>
    group_by(Marital_Status) |>
    summarize(Count = n()) 
count_summary

income_summary <- store_data_train |>
    group_by(Marital_Status) |>
    summarize(avg_income = mean(Income))
income_summary

kid_summary <- store_data_train |>
    group_by(Marital_Status) |>
    summarize(avg_kids = mean(Childhome))
kid_summary

     Marital_Status Age Income Total_Spent Childhome Response
1    Married        64  67267  221         1         0
2    Together       55  32474   11         2         0
3    Together       55  44931   89         1         0
4    Married        68  65324  539         1         0
⋮    ⋮              ⋮   ⋮      ⋮           ⋮         ⋮
1658 Married        55  77766  1502        1         1
1659 Married        55  77766  1502        1         1
1660 Divorced       39  90687  1728        0         1
1661 Divorced       62  50611   489        1         1

Rows: 1,661
Columns: 6
$ Marital_Status <chr> "Married", "Together", "Together", "Married", "Married"…
$ Age            <dbl> 64, 55, 55, 68, 75, 43, 41, 53, 64, 43, 46, 53, 57, 66,…
$ Income         <dbl> 67267, 32474, 44931, 65324, 81044, 62499, 26872, 4428, …
$ Total_Spent    <dbl> 221, 11, 89, 539, 1182, 218, 40, 38, 8, 69, 381, 660, 1…
$ Childhome      <dbl> 1, 2, 1, 1, 0, 1, 0, 1, 3, 1, 1, 1, 1, 2, 2, 2, 0, 2, 0…
$ Response       <fct> 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0…
Rows: 555
Columns: 6
$ Marital_Status <chr> "Married", "Married", "Married", "Divorced", "Single", …
$ Age            <dbl> 68, 68, 45, 64, 62, 68, 56, 32, 54, 52, 48, 70, 45, 50,…
$ Income         <dbl> 63564, 65324, 54809, 32173, 47823, 36634, 43456, 18351,…
$ Total_Spent    <dbl> 1150, 539, 152, 20, 62, 305, 386, 36, 836, 30, 46, 60, …
$ Childhome      <dbl> 0, 1, 2, 1, 1, 1, 1, 0, 1, 2, 1, 2, 1, 2, 2, 0, 0, 0, 1…
$ Response       <fct> 1, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 1, 0, 1, 0, 1, 1, 0, 0…

  Marital_Status Count
1 Absurd           1
2 Alone            2
3 Divorced       175
4 Married        640
5 Single         345
6 Together       438
7 Widow           58
8 YOLO             2

  Marital_Status avg_income
1 Absurd         79244.00
2 Alone          35018.00
3 Divorced       52487.06
4 Married        52297.23
5 Single         50451.97
6 Together       53123.41
7 Widow          57797.17
8 YOLO           48432.00

  Marital_Status avg_kids
1 Absurd         0.0000000
2 Alone          1.5000000
3 Divorced       0.9828571
4 Married        0.9625000
5 Single         0.8695652
6 Together       1.0022831
7 Widow          0.8793103
8 YOLO           1.0000000

LMAO look at the marital_status chart